export default function UK(){
    return(
        <>
        <div className="container row justify-content-center">
      <div className="card">
        <h1>Уголовный кодекс сервера DEGROCRAFT</h1>

        <h2>Общая часть</h2>
        <h3>Раздел I. Основные положения</h3>
        <ul>
          <li><strong>Статья 1. Основные понятия</strong></li>
          <ul>
            <li>1.1. АР — алмазная руда (основная валюта наказания).</li>
            <li>
              1.2. Доказательства — скриншоты, видеозаписи, показания
              свидетелей.
            </li>
            <li>1.3. Территория — любое пространство в игровом мире.</li>
            <li>
              1.4. Ивенты — это специальные игровые мероприятия, организуемые
              администрацией или игроками, основывающиеся на положениях
              Уголовного кодекса DEGROCRAFT. Участие в ивентах регулируется его
              правилами и условиями, которые не должны противоречить основным
              законам сервера.
            </li>
            <li>
              1.5. Общественные постройки — это объекты инфраструктуры сервера,
              такие как спавн, адский хаб и другие сооружения,
              доступные всем игрокам. Эти постройки предназначены для общего
              пользования, упрощения перемещений, торговли и взаимодействия.
            </li>
            <li>
              1.6. Договор (контракт) — это соглашение между сторонами,
              заключённое для предоставления услуг или выполнения определённых
              обязательств. В договоре фиксируются условия, обязанности, права и
              сроки исполнения.
            </li>
            <li>
              1.7. Игроки-провокаторы — это игроки, чьи действия направлены на
              создание конфликтных ситуаций или намеренное нарушение спокойствия
              других игроков. Провокации могут включать удары рукой, помехи
              передвижению или угрожающие действия.
            </li>
            <li>
              1.8. Должностное лицо — это лица, занимающие официальные позиции
              в управлении сервером, включая куратора торговли, хранителя
              истории, судей, адвокатов и так далее.
            </li>
            <li>
              1.9. RP-процесс — это ролевое взаимодействие между игроками,
              основанное на соблюдении установленных правил и сценариев.
            </li>
          </ul>
        </ul>

        <h2>Особенная часть</h2>

        <h3>Раздел II. Правила RP процесса.</h3>
        <ul>
          <li><strong>Статья 2. RP процесс.</strong></li>
          <ul>
            <li>
              2.1. Участие в RP-процессе является добровольным, и никто не
              вправе принуждать игрока к участию в нём. Проведение судебных
              мероприятий не считается частью RP-процесса.
            </li>
            <li>
              2.2. Если игрок принимает участие в RP-процессе, он обязан
              следовать правилам RP.
            </li>
            <li>
              2.3. Все споры, возникшие в RP-процессе, могут быть урегулированы
              через судебную систему, если их последствия затрагивают права
              игроков.
            </li>
            <li>
              2.4. Прерывание RP-процесса (гриферство, грубые нарушения
              сценария) может повлечь за собой судебные меры в зависимости от
              тяжести нарушения.
            </li>
          </ul>
        </ul>

        <h3>Раздел III. Права игроков на территорию.</h3>
        <ul>
          <li><strong>Статья 3. Права на территорию.</strong></li>
          <ul>
            <li>
              3.1. Любой игрок вправе владеть любой территорией которая не
              находится в общественной зоне, не мешает проведению ивентов или
              подобное. Также территория не должна быть занята игроком.
            </li>
            <li>
              3.2. Владелец территории вправе объявить данную территорию
              “запреткой” для других игроков.
            </li>
            <li>
              3.3. Если игрок не заходил на сервер более 60 дней и это можно
              подтвердить (к примеру логами) его имущество и территория теряют
              статус запретки.
            </li>
          </ul>
        </ul>

        <h3>Раздел IV. Авторское право игроков.</h3>
        <ul>
          <li><strong>Статья 5. Авторское право.</strong></li>
          <ul>
            <li>
              5.1. Постройки, арты, художественные работы и любой другой
              контент, созданный игроком, считаются его интеллектуальной
              собственностью и защищены от копирования или использования без
              разрешения автора.
            </li>
            <li>
              5.2. Игрок имеет право требовать компенсацию за разрушение,
              копирование или использование его контента без согласия.
            </li>
            <li>
              5.3. Копирование, использование или воспроизведение контента без
              разрешения автора может быть наказано штрафом в размере от 15 до
              100 АР, в зависимости от масштаба и степени нарушения.
            </li>
            <li>
              5.4. При использовании идей, элементов дизайна построек или
              художественных работ других игроков необходимо указывать автора,
              если это согласовано с ним.
            </li>
            <li>
              5.5. Художественные работы (арты) должны распространяться с
              указанием автора. Использование таких работ в целях продвижения,
              продажи или иных коммерческих задач возможно только с разрешения
              автора.
            </li>
          </ul>
        </ul>

        <h3>Раздел V. Права судьи.</h3>
        <ul>
          <li><strong>Статья 6. Неуважение к суду.</strong></li>
          <ul>
            <li>
              6.1. Если игрок мешает судебному процессу своими действиями (спам,
              громкие звуки и т.д.) — штраф от 10 до 25 АР и удаление с
              судебного процесса.
            </li>
            <li>
              6.2. Оскорбление игроков или судьи в процессе судебного
              разбирательства — штраф от 30 до 50 АР и удаление с судебного
              процесса или бан на срок до 7 дней.
            </li>
          </ul>
        </ul>

        <h3>Раздел VI. Права подсудимого.</h3>
        <ul>
          <li><strong>Статья 7. Права подсудимого.</strong></li>
          <ul>
            Подсудимый имеет право на:
            <li>
              7.1. Справедливое и независимое судебное разбирательство,
              основанное на УК и законах сервера.
            </li>
            <li>
              7.2. Получение бесплатного государственного адвоката, если он не
              может нанять личного.
            </li>
            <li>
              7.3. Подачу апелляции на решение суда в установленном порядке.
            </li>
            <li>
              7.4. Ознакомление со всеми доказательствами, представленными
              против него.
            </li>
            <li>
              7.5. Защиту от оскорблений, угроз или давления во время судебного
              процесса.
            </li>
            <li>
              7.6. Внесение объяснений и предоставление своих доказательств или
              свидетелей.
            </li>
          </ul>
        </ul>

        <h3>Раздел VII. Преступления против игрока</h3>
        <h4>Глава 1. Преступления против жизни и здоровья</h4>
        <ul>
          <li><strong>Статья 8. Убийство</strong></li>
          <ul>
            <li>
              8.1. Убийство игрока без его согласия — штраф от 30 до 50 АР с
              полным возвратом ресурсов.
            </li>
            <li>
              8.1. Убийство игрока-провокатора или убийство на запретке — полный
              возврат ресурсов.
            </li>
            <li>
              8.2. Убийство игрока на спавне — штраф от 20 до 40 АР с полным
              возвратом ресурсов.
            </li>
            <li>
              8.3. Убийство игрока на спавне без его согласия — штраф от 35 до
              70 АР с полным возвратом ресурсов.
            </li>
            <li>
              8.4. Убийство во время ивента, не предусматривающего PVP — штраф
              от 40 до 65 АР.
            </li>
            <li>
              8.5. Массовое убийство (3 и более игроков) — штраф 50 АР за
              каждого убитого или бан.
            </li>
            <li>
              8.6. Массовое убийство (3 и более игроков) во время ивента, не
              предусматривающего PVP — штраф от 50 до 65 АР за каждого убитого
              или бан.
            </li>
            <li>
              8.7. Преднамеренное убийство питомца игрока — штраф от 10 до 20
              АР.
            </li>
          </ul>
          <li><strong>Статья 9. Нанесение урона</strong></li>
          <ul>
            <li>
              9.1. Намеренное использование зелий с негативным эффектом против
              игрока — штраф до 20 АР.
            </li>
            <li>
              9.2. Использование взрывоопасных блоков против игрока — штраф от
              20 до 50 АР.
            </li>
            <li>
              9.3. Использование ловушек против игрока — штраф от 10 до 40 АР.
            </li>
          </ul>
        </ul>

        <h4>Глава 2. Преступления против собственности игрока</h4>
        <ul>
          <li><strong>Статья 10. Кража</strong></li>
          <ul>
            <li>
              10.1. Кража личного имущества — штраф от 15 до 50 АР с возмещением
              украденного.
            </li>
            <li>
              10.2. Кража из сундуков магазина — штраф от 10 до 40 АР с
              возмещением украденного.
            </li>
          </ul>
          <li><strong>Статья 11. Гриферство</strong></li>
          <ul>
            <li>
              11.1. Намеренное разрушение частных построек — штраф от 1 до 3 АР
              за каждый блок с восстановлением разрушенного.
            </li>
            <li>
              11.2. Ненамеренное разрушение частных построек — восстановление
              разрушенного.
            </li>
            <li>
              11.3. Намеренное разрушение общественных построек — бан или штраф
              от 3 до 5 АР за каждый блок.
            </li>
            <li>
              11.4. Ненамеренное разрушение общественных построек — штраф от 1
              до 3 АР за каждый блок.
            </li>
            <li>
              11.5. Намеренная порча фермы — штраф от 20 до 50 АР с
              предоставлением ресурсов для восстановления или восстановлением
              разрушенного.
            </li>
            <li>
              11.6. Ненамеренная порча фермы — штраф от 15 до 30 АР с
              предоставлением ресурсов для восстановления или восстановлением
              разрушенного.
            </li>
            <li>
              11.7. Нарушение природного ландшафта на общественных территориях:
            </li>
            <ul>
              <li>
                11.7.1. Запрещается каким-либо способом разрушать или изменять
                природный ландшафт на общественных территориях в радиусе 500
                блоков от точки появления игрока.
              </li>
              <li>
                11.7.2. За взрывы, разрушающие ландшафт, налагается штраф в
                размере от 10 до 25 АР за каждый поврежденный чанк.
              </li>
              <li>
                11.7.3. За создание лавакастов на общественных или частных
                территориях налагается штраф в размере от 10 до 50 АР за каждый
                чанк.
              </li>
            </ul>
          </ul>
          <li><strong>Статья 12. Мошенничество</strong></li>
          <ul>
            <li>12.1. Подделка документов — штраф от 15 до 300 АР.</li>
            <li>12.2. Обман при обмене — штраф от 8 до 80 АР.</li>
          </ul>
          <li><strong>Статья 13. Проникновение на запретку</strong></li>
          <ul>
            <li>
              13.1. Проникновение на территорию города, наружную территорию
              базы, отмеченной запреткой: если нарушитель не удалился после
              предупреждения — штраф от 10 до 40 АР.
            </li>
            <li>
              13.2. Проникновение на территорию частной фермы или склада — штраф
              от 20 до 50 АР.
            </li>
            <li>
              13.3. Проникновение на территорию фермы или склада, принадлежащего
              объединению игроков — штраф от 25 до 60 АР.
            </li>
            <li>
              13.4. Проникновение на территорию, где находятся объекты,
              защищенные интеллектуальной собственностью; во внутреннюю часть
              сложных механизмов — штраф от 30 до 90 АР.
            </li>
            <li>13.5. Нарушение черного списка — штраф от 20 до 40 АР.</li>
          </ul>
        </ul>

        <h3>Раздел VIII. Нарушения договора</h3>
        <ul>
          <li><strong>Статья 14. Договорные отношения</strong></li>
          <ul>
            <li>14.1. Неисполнение договора — штраф от 20 до 150 АР.</li>
            <li>
              14.2. Расторжение договора без исполнений обязательств — штраф от
              10 до 100 АР.
            </li>
          </ul>
        </ul>

        <h3>Раздел IX. Преступления против порядка</h3>
        <ul>
          <li><strong>Статья 15. Нарушение правил строительства</strong></li>
          <ul>
            <li>
              15.1. Строительство на чужой территории без согласия — снос и
              штраф от 10 до 50 АР.
            </li>
            <li>
              15.2. Строительство на общественной территории без одобрения
              соответствующих должностных лиц — снос и штраф от 10 до 50 АР.
            </li>
            <li>
              15.3. Строительство назойливых механизмов на общественной
              территории — снос и штраф от 10 до 60 АР.
            </li>
          </ul>
        </ul>

        <h3>Раздел X. Должностные преступления</h3>
        <ul>
          <li><strong>Статья 16. Злоупотребление полномочиями</strong></li>
          <ul>
            <li>
              16.1. Превышение прав должностого лица — снятие с должности и
              запрет занимать какие-либо должности на текущий сезон.
            </li>
            <li>
              16.2. Взяточничество — штраф до 300 АР, снятие с должности и
              запрет занимать какие-либо должности на текущий сезон.
            </li>
            <li>
              16.3. Любая угроза статусом должностного лица — штраф от 20 до 70
              АР, снятие с должности и запрет занимать какие-либо должности на
              текущий сезон.
            </li>
            <li>
              16.4. Использование должностных полномочий во вред сервера — штраф
              от 20 до 100 АР, снятие с должности и запрет занимать какие-либо
              должности на текущий сезон.
            </li>
          </ul>
        </ul>

        <h2>Процессуальная часть</h2>
        <ul>
          <li><strong>Статья 17. Смягчающие обстоятельства</strong></li>
          <ul>
            <li>
              17.1. Добровольное признание вины, при том что обвиняемый ни разу
              не отрицал вины — снижение штрафа на 15%.
            </li>
            <li>
              17.2. Возмещение ущерба до завершения судебного процесса —
              снижение штрафа на 25%.
            </li>
            <li>
              17.3. Общественно активные игроки с хорошей репутацией (активное
              участие в жизни сервера, помощь другим игрокам, отсутствие
              нарушений) — снижение штрафа на 15-25%, в зависимости от вклада в
              развитие сообщества.
            </li>
          </ul>
          <li><strong>Статья 18. Отягчающие обстоятельства</strong></li>
          <ul>
            <li>18.1. Повторное нарушение — увеличение штрафа на 30%.</li>
            <li>18.2. Групповое нарушение — увеличение штрафа на 50%.</li>
            <li>18.3. Сокрытие улик — увеличение штрафа на 15%.</li>
            <li>
              18.4. Использование взрывоопасных блоков для убийства — увеличение
              штрафа на 30%.
            </li>
            <li>
              18.5. Использование ловушек для/при убийства(е) — увеличение
              штрафа на 75%.
            </li>
            <li>
              18.5. Отсутствие возможности возмещения украденного — увеличение
              штрафа по статье кража на 75%.
            </li>
            <li>
              18.6. Поджог или использование взрывоопасных блоков при разрушении
              построек — увеличение штрафа по статье гриферство на сумму от 10
              до 30 АР.
            </li>
            <li>
              18.7. Проникновение на запретку под зельем невидимости —
              увеличение штрафа по статье проникновение на запретку на 15%.
            </li>
            <li>
              18.8. Многократное убийство игрока — увеличение штрафа на 10 АР за
              каждое убийство.
            </li>
            <li>
              18.9. Намеренное уничтожение ресурсов — увеличение штрафа на сумму
              от 20 до 80 АР и возмещение ресурсов или же их стоимости.
            </li>
          </ul>
        </ul>

        <h2>Заключительные положения</h2>
        <ul>
          <li><strong>Статья 19. Сроки наказания</strong></li>
          <ul>
            <li>19.1. Выплата штрафов в течение 3 до 21 дня.</li>
            <li>
              19.2. С каждым днем просрочки оплаты штрафа, сумма возрастает на
              10% от текущей суммы штрафа.
            </li>
            <li>
              19.3. Если срок просрочки оплаты штрафа превышает 20 дней,
              продолжение просрочки приведет к бану.
            </li>
            <li>19.4. Возможность рассрочки по решению суда.</li>
            <li>
              19.5. Судебные издержки оплачиваются истцом или обвиняемым в
              случае растягивания судебного процесса.
            </li>
            <li>19.6. Пошлины.</li>
            <li>Подача дела в суд - от 5 до 15 АР.</li>
            <li>Аппеляция или оспаривание дела в суде - от 10 до 20 АР.</li>
            <li>
              Формулы Судебные издержки = Базовый взнос + (Количество часов ×
              Ставка за час × привлеченных игроков) + Дополнительные расходы
            </li>
          </ul>
          <li><strong>Статья 20. Судебная процедура</strong></li>
          <ul>
            <li>
              20.1. Вынесение вердикта по делу должно происходить в течение 48
              часов реального времени с момента подачи заявления в зависимости
              от сложности дела.
            </li>
            <li>
              20.2. Если игрок предоставляет заведомо ложные доказательства или
              показания в рамках судебного разбирательства — штраф в размере от
              20 до 75 АР.
            </li>
            <li>
              20.3. Подача судебного иска с несерьезной или шуточной причиной,
              не имеющей оснований для разбирательства — штраф в размере 20 АР.
            </li>
          </ul>
          <li><strong>Статья 21. Амнистия</strong></li>
          <ul>
            <li>
              21.1. Возможность амнистии во время крупных серверных событий.
            </li>
            <li>21.2. Условия амнистии определяются отдельно.</li>
          </ul>
          <li><strong>Статья 22. Изменение кодекса</strong></li>
          <ul>
            <li>
              22.1. Настоящий уголовный кодекс может быть изменен голосованием
              судей.
            </li>
          </ul>
        </ul>
      </div>
    </div>
        </>
    )
}